.doom.d/config.el
;; [[file:config.org::*Set user full-name and mail-address][Set user full-name and mail-address:1]]
(setq user-full-name "Simon"
      user-mail-address "soelder@hotmail.com")
;; Set user full-name and mail-address:1 ends here

;; [[file:config.org::*Keymaps][Keymaps:1]]
(map!
 :desc "Switch dictionary"
 :leader "j d"
 'fd-switch-dictionary)

(map!
 :desc "org-pretty modde"
 :leader "j p"
 '+org-pretty-mode)

(map!
 :desc "Increase font size"
 :leader "j +"
 'doom/increase-font-size )

(map!
 :desc "Decrease font size"
 :leader "j -"
 'doom/decrease-font-size )

;; evaluation stuff
(map! :leader
      :desc "Evaluate elisp in buffer"
      "e b" #'eval-buffer
      :leader
      :desc "Evaluate defun"
      "e d" #'eval-defun
      :leader
      :desc "Evaluate elisp expression"
      "e e" #'eval-expression
      :leader
      :desc "Evaluate last sexpression"
      "e l" #'eval-last-sexp
      :leader
      :desc "Evaluate elisp in region"
      "e r" #'eval-region)

(map!
 :desc "Switch to buffer"
 :leader "j s"
 #'switch-to-buffer)

(map!
 :desc "Jumps to last buffer"
 :leader
 "j b" #'evil-switch-to-windows-last-buffer)

(map!
 :desc "Open mediacube wiki"
 :leader
 "j m" #'open-mediacube)

(map!
 :desc "Open flycheck setup"
 :leader
 "j f" #'flycheck-verify-setup)

(map!
 :desc "Edit org babel "
 :leader
 "j e" #'org-edit-special)

(map!
 :desc "switch to other workspace"
 :leader
 "j o" '+workspace/other)

(map!
 :desc "wrap in org-block"
 :leader
 "j w" 'org-insert-structure-template)
;; Keymaps:1 ends here

;; [[file:config.org::*Set font options:][Set font options::1]]
;; (setq doom-font (font-spec :family "Fira Code" :size 15)
;;       doom-variable-pitch-font (font-spec :family "Fira Code" :size 16) ; inherits `doom-font''s :size
;;       doom-big-font (font-spec :family "Fira Code" :size 19))
;;
(setq doom-font (font-spec :family "Comic Code Ligatures Medium" :size 17)
      doom-variable-pitch-font (font-spec :family "Comic Code Ligatures" :size 21)
      doom-big-font (font-spec :family "Source Code Pro" :size 25))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  )

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
(setq global-prettify-symbols-mode t)
;; Set font options::1 ends here

;; [[file:config.org::*Set doom-theme][Set doom-theme:1]]
(setq doom-theme 'doom-gruvbox)
;; Set doom-theme:1 ends here

;; [[file:config.org::*Load theme][Load theme:1]]
(defun ap/load-doom-theme (theme)
  "Disable active themes and load a Doom theme."
  (interactive (list (intern (completing-read "Theme: "
                                              (->> (custom-available-themes)
                                                   (-map #'symbol-name)
                                                   (--select (string-prefix-p "doom-" it)))))))
  (ap/switch-theme theme)

  (set-face-foreground 'org-indent (face-background 'default)))

(defun ap/switch-theme (theme)
  "Disable active themes and load THEME."
  (interactive (list (intern (completing-read "Theme: "
                                              (->> (custom-available-themes)
                                                   (-map #'symbol-name))))))
  (mapc #'disable-theme custom-enabled-themes)
  (load-theme theme 'no-confirm))
;; Load theme:1 ends here

;; [[file:config.org::*Splash Screen][Splash Screen:1]]
(setq fancy-splash-image "~/.doom.d/splash.png")
;; Splash Screen:1 ends here

;; [[file:config.org::*Set org-directory][Set org-directory:1]]
(setq org-directory "~/org/")
;; Set org-directory:1 ends here

;; [[file:config.org::*Performance Tweaks][Performance Tweaks:1]]
;; (setq remote-file-name-inhibit-cache nil)
;; (setq vc-ignore-dir-regexp
;;       (format "%s\\|%s"
;;                     vc-ignore-dir-regexp
;;                     tramp-file-name-regexp))
;; (setq tramp-verbose 1)
;; Performance Tweaks:1 ends here

;; [[file:config.org::*treesitter][treesitter:1]]
;; (use-package! tree-sitter
;;   :config
;;   (require 'tree-sitter-langs)
;;   (global-tree-sitter-mode)
;;   (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))
;; treesitter:1 ends here

;; [[file:config.org::*Disable format on save for =authinfo= mode][Disable format on save for =authinfo= mode:1]]
(add-hook! authinfo-mode-hook (format-all-mode -1))
;; Disable format on save for =authinfo= mode:1 ends here

;; [[file:config.org::*Some more settings, not sure where to put them yet][Some more settings, not sure where to put them yet:1]]
;; (setq display-line-numbers-type t)
;; (setq doom-gc-cons-threshold 33554432)
;; (setq tramp-default-method "ssh")
;; (setq ranger-override-dired-mode t)
;; (setq auto-save-default t)
;; (setq evil-want-fine-undo t)
;; (global-auto-revert-mode 1)
;; (setq undo-limit 80000000)
;; (setq inhibit-compacting-font-caches t)
;; (whitespace-mode -1)

;; (setq-default
;;  ;; tab-width 4
;;  uniquify-buffer-name-style 'forward
;;  window-combination-resize t
;;  x-stretch-cursor nil)
;; Some more settings, not sure where to put them yet:1 ends here

;; [[file:config.org::*Move items to trash on delete][Move items to trash on delete:1]]
(setq
 trash-directory "~/.Trash/"
 delete-by-moving-to-trash t)
;; Move items to trash on delete:1 ends here

;; [[file:config.org::*Winner mode to undo/redo window managamanet][Winner mode to undo/redo window managamanet:1]]
;; (map! :leader
;;       (:prefix ("w" . "window")
;;        :desc "Winner redo" "<right>" #'winner-redo
;;        :desc "Winner undo" "<left>" #'winner-undo))
;; Winner mode to undo/redo window managamanet:1 ends here

;; [[file:config.org::*emacsclient][emacsclient:1]]
(after! persp-mode
  (setq persp-emacsclient-init-frame-behaviour-override "main"))
;; emacsclient:1 ends here

;; [[file:config.org::*GitHub Copilot][GitHub Copilot:1]]
(defun my-tab ()
  (interactive)
  (or (copilot-accept-completion)
      (company-indent-or-complete-common nil)))

(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (("C-TAB" . 'copilot-accept-completion-by-word)
         ("C-<tab>" . 'copilot-accept-completion-by-word)
         :map company-active-map
         ("<tab>" . 'my-tab)
         ("TAB" . 'my-tab)
         :map company-mode-map
         ("<tab>" . 'my-tab)
         ("TAB" . 'my-tab)))
;; GitHub Copilot:1 ends here

;; [[file:config.org::*Enable treesitter][Enable treesitter:1]]
;; (add-to-list 'auto-mode-alist '("\\.cs\\'" . csharp-tree-sitter-mode))
;; (add-hook 'csharp-tree-sitter-mode-hook #'lsp)
;; Enable treesitter:1 ends here
