.doom.d/config.el

;; [[file:config.org::*Typescript/Javascipt/WEB][Typescript/Javascipt/WEB:1]]
;; (setq! typescript-indent-level 2)
;; (setq! js-indent-level 2)
;; (setq! web-mode-css-indent-offset 2)
;; (setq-hook! 'js2-mode-hook +format-with-lsp nil)
;; (setq-hook! js2-jsx-mode-hook +format-with-lsp nil)
;; (setq-hook! 'typescript-mode-hook +format-with-lsp nil)
;; (setq-hook! 'typescript-tsx-mode-hook +format-with-lsp nil)
;; (setq! lsp-eslint-enable t)

;; (add-hook! 'typescript-tsx-mode-hook 'rainbow-mode)
;; (add-hook! 'typescript-mode-hook 'rainbow-mode)
;; (add-hook! 'tsx-mode-hook 'rainbow-mode)

;; (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-mode))
;; (add-to-list 'auto-mode-alist '("\\.tsx\\'" . typescript-mode))
;; Typescript/Javascipt/WEB:1 ends here

;; [[file:config.org::*Typescript/Javascipt/WEB][Typescript/Javascipt/WEB:2]]
;; (require 'react-snippets)
;; Typescript/Javascipt/WEB:2 ends here

;; [[file:config.org::*Require dap-mode][Require dap-mode:1]]
;; (require 'dap-node)
;; (require 'dap-firefox)
;; (require 'dap-ruby)
;; (require 'dap-lldb)
;; (require 'dap-netcore)
;; Require dap-mode:1 ends here
