.doom.d/config.org
*** Set dap-mode firefox debug program
#+begin_src emacs-lisp :tangle yes
;; (dap-register-debug-template "Firefox Browse my-project"
;;   (list :type "firefox"
;;         :reAttach t
;;         :request "launch"
;;         :webRoot "/home/simon/development/return-to-wintervale/apps/controller"
;;         :url "http://controller.localhost&"
;;         :name "Fireox Browse my-project"))

#+end_src

#+RESULTS:
| Firefox Browse my-project           | :type | firefox     | :reAttach | t                  | :request | launch    | :webRoot | /home/simon/development/return-to-wintervale/apps/controller | :url             | http://controller.localhost& | :name     | Fireox Browse my-project |                |                    |      |     |                     |             |             |             |
| Firefox Run Configuration           | :type | firefox     | :cwd      | nil                | :request | launch    | :file    | nil                                                          | :reAttach        | t                            | :program  | nil                      | :name          | Firefox::Run       |      |     |                     |             |             |             |
| Ruby Run Configuration              | :type | Ruby        | :cwd      | nil                | :request | launch    | :program | nil                                                          | :name            | Ruby::Run                    |           |                          |                |                    |      |     |                     |             |             |             |
| Chrome Browse URL                   | :type | chrome      | :cwd      | nil                | :mode    | url       | :request | launch                                                       | :webRoot         | nil                          | :url      | nil                      | :name          | Chrome Browse URL  |      |     |                     |             |             |             |
| Chrome Browse File                  | :type | chrome      | :mode     | file               | :cwd     | nil       | :request | launch                                                       | :file            | nil                          | :reAttach | t                        | :name          | Chrome Browse File |      |     |                     |             |             |             |
| Node Run Configuration              | :type | node        | :cwd      | nil                | :request | launch    | :program | nil                                                          | :name            | Node::Run                    |           |                          |                |                    |      |     |                     |             |             |             |
| .Net Core Launch (Console)          | :type | coreclr     | :request  | launch             | :mode    | launch    | :name    | NetCoreDbg::Launch                                           | :dap-compilation | dotnet build                 |           |                          |                |                    |      |     |                     |             |             |             |
| .Net Core Attach (Console)          | :type | coreclr     | :request  | attach             | :mode    | attach    | :name    | NetCoreDbg::Attach                                           |                  |                              |           |                          |                |                    |      |     |                     |             |             |             |
| LLDB Run Configuration              | :type | lldb        | :request  | launch             | :name    | LLDB::Run | :target  | nil                                                          | :cwd             | nil                          |           |                          |                |                    |      |     |                     |             |             |             |
| GDBServer Connect Configuration     | :type | gdbserver   | :name     | GDBServer::Connect | :target  | nil       | :cwd     | nil                                                          | :executable      | nil                          | :autorun  | nil                      | :debugger_args | nil                | :env | nil | :showDevDebugOutput | :json-false | :printCalls | :json-false |
| GDB Run Configuration               | :type | gdb         | :request  | launch             | :name    | GDB::Run  | :target  | nil                                                          | :cwd             | nil                          |           |                          |                |                    |      |     |                     |             |             |             |
| LLDB (VS Code) :: Run Configuration | :type | lldb-vscode | :cwd      | nil                | :request | launch    | :program | nil                                                          | :name            | LLDB::Run                    |           |                          |                |                    |      |     |                     |             |             |             |

*** Disable all distracting LSP UI Presets
#+begin_src elisp :tangle yes
;; (setq
;;  ;; lsp-eldoc-render-all nil
;;  lsp-eldoc-enable-hover t

;;  lsp-ui-doc-enable t
;;  lsp-ui-doc-show-with-mouse t

;;  lsp-ui-sideline-show-hover nil
;;  lsp-ui-sideline-show-diagnostics t
;;  lsp-ui-sideline-show-symbol t
;;  lsp-ui-sideline-show-code-actions nil

;;  lsp-ui-peek-enable t
;;  lsp-ui-peek-show-directory t

;;  lsp-headerline-breadcrumb-enable t

;;  lsp-lens-enable nil

;;  lsp-enable-symbol-highlighting t

;;  ;; Disable Signature
;;  lsp-signature-auto-activate t
;;  lsp-signature-render-documentation t
;;  lsp-signature-doc-lines 1

;;  ;; Disable make error highlighting
;;  ;; lsp-prefer-flymake nil
;;  )


;; ;; (setq-hook! 'js2-mode lsp-eldoc-enable-hover nil)

;; ;; (setq lsp-on-idle-hook nil)
#+end_src

#+RESULTS:
: 1

** Flycheck
*** Disable LSP as default checker and set checker for each major mode
#+begin_src elisp :tangle yes
;; (after! lsp-mode
;;   (remove-hook 'lsp-mode-hook #'+lsp-init-flycheck-or-flymake-h))

;; (defun +js/fix-checker ()
;;   "Fix LSP overwritten checkers."
;;   (interactive)
;;   (when (-contains? '(js2-mode typescript-mode js2-jsx-mode rjsx-mode typescript-tsx-mode) major-mode)
;;     (flycheck-select-checker 'javascript-eslint)))

;; (add-hook 'lsp-mode-hook #'+js/fix-checker)


;; (lsp-defun my/filter-typescript ((params &as &PublishDiagnosticsParams :diagnostics)
;;                                  _workspace)
;;   (lsp:set-publish-diagnostics-params-diagnostics
;;    params
;;    (or (seq-filter (-lambda ((&Diagnostic :source? :severity?))
;;                      (and (not (string= "typescript" source?))
;;                           (< severity? lsp/diagnostic-severity-information)))
;;                    diagnostics)
;;        []))
;;   params)


;; (setq lsp-diagnostic-filter 'my/filter-typescript )

;; (setq-default flycheck-disabled-checkers '(javascript-eslint))
#+end_src

#+RESULTS:

** Misc Functions
*** Switch to german dictionary (ispell)
#+begin_src elisp :tangle yes
;; switch to german dic
(defun fd-switch-dictionary()
  (interactive)
  (let* ((dic ispell-current-dictionary)
         (change (if (string= dic "deutsch8") "english" "deutsch8")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)
    ))
#+end_src

*** Test native JSON and native compilation
#+begin_src emacs-lisp :tangle yes
(defun test-native-comp ()
  (interactive)
  (if (and (fboundp 'native-comp-available-p)
           (native-comp-available-p))
      (message "Native compilation is available")
    (message "Native complation is *not* available")))

(defun test-native-json ()
  (interactive)
  (if (functionp 'json-serialize)
      (message "Native JSON is available")
    (message "Native JSON is *not* available")))
#+end_src

#+RESULTS:
: test-native-json

