.doom.d/config.el

;; [[file:config.org::*Set dap-mode firefox debug program][Set dap-mode firefox debug program:1]]
;; (dap-register-debug-template "Firefox Browse my-project"
;;   (list :type "firefox"
;;         :reAttach t
;;         :request "launch"
;;         :webRoot "/home/simon/development/return-to-wintervale/apps/controller"
;;         :url "http://controller.localhost&"
;;         :name "Fireox Browse my-project"))
;; Set dap-mode firefox debug program:1 ends here

;; [[file:config.org::*Disable all distracting LSP UI Presets][Disable all distracting LSP UI Presets:1]]
;; (setq
;;  ;; lsp-eldoc-render-all nil
;;  lsp-eldoc-enable-hover t

;;  lsp-ui-doc-enable t
;;  lsp-ui-doc-show-with-mouse t

;;  lsp-ui-sideline-show-hover nil
;;  lsp-ui-sideline-show-diagnostics t
;;  lsp-ui-sideline-show-symbol t
;;  lsp-ui-sideline-show-code-actions nil

;;  lsp-ui-peek-enable t
;;  lsp-ui-peek-show-directory t

;;  lsp-headerline-breadcrumb-enable t

;;  lsp-lens-enable nil

;;  lsp-enable-symbol-highlighting t

;;  ;; Disable Signature
;;  lsp-signature-auto-activate t
;;  lsp-signature-render-documentation t
;;  lsp-signature-doc-lines 1

;;  ;; Disable make error highlighting
;;  ;; lsp-prefer-flymake nil
;;  )


;; ;; (setq-hook! 'js2-mode lsp-eldoc-enable-hover nil)

;; ;; (setq lsp-on-idle-hook nil)
;; Disable all distracting LSP UI Presets:1 ends here

;; [[file:config.org::*Disable LSP as default checker and set checker for each major mode][Disable LSP as default checker and set checker for each major mode:1]]
;; (after! lsp-mode
;;   (remove-hook 'lsp-mode-hook #'+lsp-init-flycheck-or-flymake-h))

;; (defun +js/fix-checker ()
;;   "Fix LSP overwritten checkers."
;;   (interactive)
;;   (when (-contains? '(js2-mode typescript-mode js2-jsx-mode rjsx-mode typescript-tsx-mode) major-mode)
;;     (flycheck-select-checker 'javascript-eslint)))

;; (add-hook 'lsp-mode-hook #'+js/fix-checker)


;; (lsp-defun my/filter-typescript ((params &as &PublishDiagnosticsParams :diagnostics)
;;                                  _workspace)
;;   (lsp:set-publish-diagnostics-params-diagnostics
;;    params
;;    (or (seq-filter (-lambda ((&Diagnostic :source? :severity?))
;;                      (and (not (string= "typescript" source?))
;;                           (< severity? lsp/diagnostic-severity-information)))
;;                    diagnostics)
;;        []))
;;   params)


;; (setq lsp-diagnostic-filter 'my/filter-typescript )

;; (setq-default flycheck-disabled-checkers '(javascript-eslint))
;; Disable LSP as default checker and set checker for each major mode:1 ends here

;; [[file:config.org::*Switch to german dictionary (ispell)][Switch to german dictionary (ispell):1]]
;; switch to german dic
(defun fd-switch-dictionary()
  (interactive)
  (let* ((dic ispell-current-dictionary)
         (change (if (string= dic "deutsch8") "english" "deutsch8")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)
    ))
;; Switch to german dictionary (ispell):1 ends here

;; [[file:config.org::*Test native JSON and native compilation][Test native JSON and native compilation:1]]
(defun test-native-comp ()
  (interactive)
  (if (and (fboundp 'native-comp-available-p)
           (native-comp-available-p))
      (message "Native compilation is available")
    (message "Native complation is *not* available")))

(defun test-native-json ()
  (interactive)
  (if (functionp 'json-serialize)
      (message "Native JSON is available")
    (message "Native JSON is *not* available")))
;; Test native JSON and native compilation:1 ends here
